src/mathematics/linear_algebra/KBrefFunctionRange.org
:PROPERTIES:
:ID:       3E73EECC-04AF-441B-B105-195D3F7CC2A0
:END:
#+AUTHOR: Exr0n
#+TITLE: Range of a function
* Intuition
  All of the valid outputs of the function, everything that the function can equal when fed an element of the domain.
* In the context of linear algebra (Axler 3.18)
  #+begin_quote
  For $T$ a function from $V$ to $W$, the /range/ of $T$ is the subset of $W$ consisting of those vectors that are of the form $Tv$ for some $v \in V$:
  $$\text{range }T = \{Tv : v \in V\}$$
  #+end_quote
** #aka image                                                           :aka:
** #aka column space
   The span of the columns
** See [[id:D1DEE5A5-390F-4479-93B8-A605ED8E76B0][surjectivity]], the property of a map whose range is it's output space.
